#include <stdio.h>

//单目操作符只有一个操作数

//双目操作符有两个操作数

//+
//-
//!
//&
//sizeof
//~
//++ --
//*
//(强制类型转换)

int main()
{
    //！
    // int flag=3;
    // //flag为真进入if
    // if(flag)
    // {}
    // //!flag为假不进入if
    // if(!flag)
    // {}

    //+ -
    // int a=-10;
    // int b=+a;
    // printf("a=%d\nb=%d",a,b);
    
    //&
    // int a=10;
    // printf("%p",&a);//取地址，取的是a的四个字节的第一个字节(起始地址)
    // int *p=&a;
    // printf("\n%p",p);

    //sizeof
    // int a=10;
    // int n=sizeof(a);//计算的是a所占内存的大小，单位字节
    // //sizeof计算的是变量所占内存空间的大小
    // //计算类型所创建的变量占据空间的大小，单位字节
    // printf("n=%d\n",n);
    // int arr[5]={0};
    // int ze=sizeof(arr);
    // printf("%d\n",ze);

    //~
    // int a=0;
    // printf("%d\n",~a);
    //~是按二进制位取反
    // 0的补码0000 0000 0000 0000 0000 0000 0000 0000
    //取反补码1111 1111 1111 1111 1111 1111 1111 1111
    //取反反码1111 1111 1111 1111 1111 1111 1111 1110
    //取反原码1000 0000 0000 0000 0000 0000 0000 0001 =-1
    // int a=3;
    // printf("%d\n",~a);
    //~应用
    // int a=13;
    // a|=(1<<1);
    // printf("a=%d\n",a);
    // a&=~(1<<1);
    // printf("a=%d\n",a);
    //结果
    // a=15
    // a=13
    //补码0000 0000 0000 0000 0000 0000 0000 1101
    //(1<<1)0000 0000 0000 0000 0000 0000 0000 0010
    //a|(1<<1)实现0000 0000 0000 0000 0000 0000 0000 1111

    //++ --
    // int a=3;
    // int b=++a; --> a=a+1,b=a;
    //int b=a++; --> b=a,a=a+1;
    
    // printf("a=%d\nb=%d\n",a,b);

    //*
    // int a=10;
    // int *p=&a;
    // *p=20;
    // printf("%d\n",a);

    //强制类型转换
    int a= (int) 3.14;
    printf("%d\n",a);
    return 0;
}