#include <stdio.h>
//位移操作符只针对整数

//十六进制
//1~9 a~f

//整数的二进制表示有三种
//原码
//反码
//补码

//正整数的原码 反码 补码相同
//负整数的原码 反码 补码不相同

//7的二进制
//原码0000 0000 0000 0000 0000 0000 0000 0111 =1*2^2 + 1*2^1 + 1*2^0
//反码0000 0000 0000 0000 0000 0000 0000 0111 =1*2^2 + 1*2^1 + 1*2^0
//补码0000 0000 0000 0000 0000 0000 0000 0111 =1*2^2 + 1*2^1 + 1*2^0

//-7的二进制
//原码1000 0000 0000 0000 0000 0000 0000 0111
//反码1111 1111 1111 1111 1111 1111 1111 1000 原码的符号位不变，其他取反
//补码1111 1111 1111 1111 1111 1111 1111 1001 =反码+1

//整数在内存里面存储的是补码

//<<
//左移操作符
//移动的是二进制位 （补码）
//左边丢弃，右边补零

// int main()
// {
//     int a=7;
//     int b=a<<1;
//     printf("a=%d\nb=%d",a,b);
//     return 0;
// }
//结果
// a=7
// b=14
//补码 0000 0000 0000 0000 0000 0000 0000 0111 向左移动一位
//补码 0000 0000 0000 0000 0000 0000 0000 1110 
//原码 0000 0000 0000 0000 0000 0000 0000 1110

// int main()
// {
//     int a=-7;
//     int b=a<<1;
//     printf("a=%d\nb=%d",a,b);
//     return 0;
// }
//结果
// a=-7
// b=-14
//补码1111 1111 1111 1111 1111 1111 1111 1001
//补码1111 1111 1111 1111 1111 1111 1111 0010 向左移动一位
//反码1111 1111 1111 1111 1111 1111 1111 0001
//源码1000 0000 0000 0000 0000 0000 0000 1110

//所以左移操作符有乘二的效果

//>>
//右移操作符
//移动的是二进制位 （补码）
//1.算术右移位：右边丢弃，左边补原符号位
//2.逻辑右移位：右边丢弃，左边补0

// int main()
// {
//     int a=7;
//     int b=a>>1;
//     printf("a=%d\nb=%d",a,b);
//     return 0;
// }
//结果
// a=7
// b=3
//补码 0000 0000 0000 0000 0000 0000 0000 0111 向右移动一位
//补码 0000 0000 0000 0000 0000 0000 0000 0011 
//原码 0000 0000 0000 0000 0000 0000 0000 0011
//正数分不出算术移位和逻辑移位

// int main()
// {
//     int a=-7;
//     int b=a>>1;
//     printf("a=%d\nb=%d",a,b);
//     return 0;
// }
//结果
// a=-7
// b=-4
//补码1111 1111 1111 1111 1111 1111 1111 1001
//补码1111 1111 1111 1111 1111 1111 1111 1100 向右移动一位
//反码1111 1111 1111 1111 1111 1111 1111 1011
//源码1000 0000 0000 0000 0000 0000 0000 0100
//负数是算术移位

//到底是算术移位还是逻辑移位取决于编译器
//一般都是算术右移

//移动操作符的移动的位数不能是负数，使用负数是一种标准未定义行为
//移动操作符两边都应该是整数