#include <stdio.h>
// A:B第一，我第二
// B:E第四，我第二
// C:D第二，我第一
// D:C最后，我第三
// E:A第一，我第四
// 比赛结束每位选手说对一半，编程确定比赛的名次
int main()
{
    int a=0,b=0,c=0,d=0,e=0;
    for(a=1;a<=5;a++)
    {
        for(b=1;b<=5;b++)
        {
            for(c=1;c<=5;c++)
            {
                for(d=1;d<=5;d++)
                {
                    for(e=1;e<=5;e++)
                    {
                        if(((b==2) + (a==3))==1
                        && ((e==4) + (b==2))==1
                        && ((c==1) + (d==2))==1
                        && ((c==5) + (d==3))==1
                        && ((e==4) + (a==1))==1
                        && a*b*c*d*e==120
                        )
                        printf("a=%d b=%d c=%d d=%d e=%d\n",a,b,c,d,e);
                    }
                }
            }
        }
    }
    return 0;
}